`:top
> `!输出格式化文本`!


-∿
<

`c`!亻尔女子!`! 这段输出来自于 `*micron`*
Micron 于你的终端上生成格式化文本
`a

-∿
<

`Fb52译者注：
  注意:在Micron Playground中，中文的输出会显示错误，因为Playground将所有字符处理为1/2宽度，这会导致中文字符显示出现重叠，Nomad Network的终端不会出现这个问题。`f

Nomad Network支持一种名为`*micron`*的简单且实用的标记语言。如果你熟悉`*markdown`*或`*HTML`*，那么使用micron编写页面会如鱼得水。

使用Micron，你可以轻松创建带有格式、颜色、字形和图标的结构化文档和页面，超级适合在终端中展示。

>目录

 `F44f`_`[一捏捏输出示例`#s1]`_`f
 `F44f`_`[Micron标签`#s2]`_`f
 `F44f`_`[上色`#s3]`_`f
 `F44f`_`[页面前景色与背景色`#s4]`_`f
 `F44f`_`[链接`#s5]`_`f
 `F44f`_`[锚点`#s6]`_`f
 `F44f`_`[表格`#s7]`_`f
 `F44f`_`[折叠小节`#s8]`_`f
 `F44f`_`[字段与请求`#s9]`_`f
 `F44f`_`[注释`#sa]`_`f
 `F44f`_`[局部视图`#sb]`_`f
 `F44f`_`[字面量`#sc]`_`f

>>提倡与要求

尽管micron可以将格式化文本输出到最基础的终端，但为了正确地显示micron的输出，你的终端`!必须`!支持一些功能，而还有些功能虽然不是严格必需的，但却可以使体验大大升级。

如果你的终端支持，将会显示诸如`_下划线`_、`!粗体`!与`*斜体`*等格式。

如果你在正确显示`*Micron`*输出时遇到问题，可以尝试使用`*gnome-terminal`*或`*alacritty`*，它们应该可以开箱即用地使用所有格式选项。大多数其他终端也能正常工作，但你或许需要更改一些设置才能正确显示某些格式。

>>>编码

所有micron源文件都被解释为UTF-8格式，同时micron也假定它可以将UTF-8字符输出到终端。如果你的终端不支持UTF-8，那么输出将出现错误。

`Faaa译者注:这意味着你可以在Micron中使用中文和其它任何Unicode字符，前提是你的终端支持,这个中文版教程就是一个极好的例子`f

>>>色彩

对文本和背景进行着色渲染是Micron输出的重要组成部分，尽管Micron会尝试优雅地将输出降级到哪怕1位终端，但使用至少支持256色的终端将获得最佳效果。建议使用支持真彩色的终端。

>>>终端字体

虽然任何支持Unicode的字体都可以与Micron一起使用，但强烈建议使用`*"Nerd Font"`*（见`_https://www.nerdfonts.com/`_），这样输出中会增加许多额外的字形和图标。

`Faaa译者注：如果使用不支持Nerd Font的字体，使用Nerd Font的页面的图标将可能显示为�，调整Nomad Network的终端UI设置，可以将图标替换为相似的Unicode字符，这可能导致输出不如预期。`f

`:s1
>一捏捏输出示例

`F222`Bddd

`c通过Micron，你可以控制布局和展示方式
`a

``

`B33f

你可以修改背景色...

``

`B393

`r`F320...以及前景色`f
`a

`b

如果你想歇息一下下，可以插入水平分隔线。它们可以是朴素的，如下文中的分隔线，当然你可以用Unicode字符和字形来设计它们，如
  `F44f`_`[本文档开头`#top]`_`f
的波浪形分隔线。

-

`c文本可以变成`_下划线的`_, `!粗体的`! 抑或是 `*斜体的`*.

你同样可以`Bfff`Ff23`!将`!`f`b `_`Ff00各`Ff80种`Ffd0各`F9f0样`F0f2的`F0fd不`F07f同`F43f格`F70f式`Fe0f们`` `B43f`Fff0`!全!部!`!`f`b`_`*`!`B5e5`F222结合`f`Ffff起来`f`b`*`!`_ 以得到绝妙`F333`*(或者狗屎)`*`f的效果.
`a

>>>章节与标题

你可以定义任意数量的章节与小节，每一节都有自己的标题。节内的文本将会自动缩进。

-

如果你在某个节内放置一个分隔线，它将与节的缩进对齐。

>>>>>
如果不定义标题文本，该部分将作为没有标题的小节出现。这对于创建缩进文本块（如本段）非常有用。

`:s2
>Micron标签

micron中使用标签格式化文本。有些标签可以在文本中的任何位置出现，而有些则必须出现在行首。如果你需要编写的文本中包含一个会被解释为标签的序列，你可以使用字符\对其进行转义。

在接下来的部分中，将介绍不同的标签。在micron中设置的任何样式，都可以通过可以在任何位置使用的特殊\`\`标签来重置为默认样式，这将立即清除之前指定的所有格式。

>>对齐

为了控制文本对齐方式，请使用以下标签：\`c 表示居中对齐，\`l 表示左对齐，\`r 表示右对齐，\`a 表示恢复文档的默认对齐方式。对齐标签必须位于行首。示例如下：

`Faaa`B333
`!Micron`!
>>>
`=
`c此行将会居中。
此行同上。
`a对齐方式恢复为默认。
`r此行靠右行驶。
``
`=
``
>>

上述标记将产生以下输出:

`Faaa`B333
>>>
`c此行将会居中。
此行同上。
`a对齐方式恢复为默认。
`r此行靠右行驶。
``
>>

>>格式

使用\`! 标记可以将文本格式变成`!粗体`!，使用\`_ 标记可以将文本格式变成`_下划线`_，使用\`* 标记可以将文本格式变成`*斜体`*。

这是一个带格式文本的例子:

`Faaa`B333
`!Micron`!
>>>
`=
我们很快就将看到由`_下划线`_与`*斜体`*装饰的`!粗体`! 文段. 有的人甚至敢于`!`*`_将他们结合起来``!
`=
``
>>

上述标记将产生以下输出:

`Faaa`B333
>>>
我们很快就将看到由`_下划线`_与`*斜体`*装饰的`!粗体`! 文段. 有的人甚至敢于`!`*`_将他们结合起来`!`*`_!
``

>>章节

使用>标签以创建章节和小节，此标签必须置于行首。使用任意数量的>标签以指定任何级别的章节（小节）。在>标签后放置的文本将会用作该节的标题。

这是一个章节的示例：

`Faaa`B333
`!Micron`!
>>>
`=
>高层文本
这是一个章节，该文本被包含于此。

>>再来一层
这是一个小节。

>>>继续深入
一个小小节，我们还能继续，但你应当要明白这个意思了。

>>>>
对了！注意到我们还能创建没有标题的小节。它们看起来是这样的。
`=
``
>>

上述标记将产生以下输出(已取消代码块内置缩进):

`Faaa`B333
>高层文本
这是一个章节，该文本被包含于此。

>>再来一层
这是一个小节。

>>>继续深入
一个小小节，我们还能继续，但你应当要明白这个意思了。

>>>>
对了！注意到我们还能创建没有标题的小节。它们看起来是这样的。
``

`:s3
>上色

前景色可以通过\`F标签后跟三个十六进制数字来指定。若要恢复默认前景颜色，请使用\`f标签。背景颜色的指定方式相同，但需使用\`B和\`b标签。

这是一点示例：

`Faaa`B333
`!Micron`!
>>
`=
你可以`B5d5`F222使用`f`b`Ff00多`Ff80样`Ffd0的`F9f0带`F0f2有`F0fd颜`F07f色`F43f的`F70f格`Fe0f式`f来获得绝妙的效果。
`=
``
>

上述标记将产生以下输出:

`Faaa`B333
>>
你可以`B5d5`F222使用`f`B333`Ff00多`Ff80样`Ffd0的`F9f0带`F0f2有`F0fd颜`F07f色`F43f的`F70f格`Fe0f式`Faaa来获得绝妙的效果。
``
>

`:s4
>页面前景色与背景色

要为整个页面指定背景颜色，请在页面的开头放置`!#!bg=X`!头，其中`!X`!是你想要使用的颜色，例如`!444(`B444灰色`b)`!如果你同时使用了缓存控制头，那么背景指定符必须位于缓存控制头`!之后`!。同样，你也可以使用`!#!fg=X`!头来指定默认文本颜色！

`:s5
>链接

指向页面、文件或其他资源的链接可以使用\`[标签来创建，并应当以]闭合来结束。你可以创建带或者不带标签的链接，这取决于你怎么通过其他标签来控制链接的格式。虽然不是绝对必要，但至少给链接加下划线是个良好的习惯。

`Faaa`B333
`!Micron`!
>>
`=
这是一个无任何标签的链接: `[:/page/color-egg.mu]

这个 `[标签`:/page/color-egg.mu]将链接到同一个页面，但你很难在不知情的情况下看到它

这里是一个 `F00a`_`[更可见的链接`:/page/color-egg.mu]`_`f
`=
``
>

上述标记将产生以下输出:

`Faaa`B333
>>
# 从github复制作为网站时，请将该color-egg.mu文件放置于你的页面文件夹中
这是一个无任何标签的链接: `[:/page/color-egg.mu]

这个 `[标签`:/page/color-egg.mu]将链接到同一个页面，但你很难在不知情的情况下看到它

这里是一个 `F00a`_`[更可见的链接`:/page/color-egg.mu]`_`f
``
>

当内置浏览器中显示此类链接时，点击或使用键盘激活它们将使浏览器加载指定的网址。

`Fb52译者注：
  注意:Nomad Network的链接点击判定对于中文将会有错位、短位问题!（怒拍桌子声😡💢💢👊👊）
       开头的`B333\`F44f\`_\`[本文档开头\`#top]\`_\`f`b就是为此而换行的
       你仍然可以使用中文链接，但链接的可点击位置可能不符合预期，更建议的实践是链接单起一行，保证链接前的位置都是半个字宽的英文或空格
       这样仍然不能解决中文短位问题，但可点击区域至少在链接上了。`f

`:s6
>锚点

锚点让你可以在单个页面内创建跳转点，类似于 HTML 中的锚点。你用一个名称声明页面中的一个位置，然后可以从同一页面的任意位置链接到它。

>>从标题自动生成锚点

你写的每个章节标题也会自动成为一个锚点。锚点名称经由 `*slugifying`* 处理后的标题文本：英文字母转为小写，将任意连续的非字母数字字符替换为单个连字符，并除去开头或结尾的连字符。因此 `*>Hello World`* 将变成锚点 `*hello-world`* ，而 `*>Introduction & Setup`* 会变成 `*introduction-setup`* 。

`Fb52译者注：
  注意:Nomad Network的锚点不支持中文，对于中文标题，你最好参见下面的方法生成一个显式锚点`f

>>显式锚点

如果你想要一个不与标题绑定的锚点，只需在文本中的任意位置使用 \`: 标签，后跟一个名称。名称可以包含字符 A-Z、a-z、0-9、_ 和 -，并在任何其他字符（空格、换行、或标点）处结束。

`Faaa译者注:包括中文会导致中文既不会被渲染，也不能作为有效的锚点名称，建议将锚点放置于中文的上一行`f

# 原文该行有误，应为下一行
锚点本身不占空间，也不会渲染（包括不会渲染出一个空行）。它只是一个位置标记。在原本为空的行上声明的显式锚点会绑定到下一行的位置。

`Faaa`B333
`!Micron`!
>>>
`=
`:install-notes
给用户的一些安装说明。

你也可以在行中放置一个。例如：见 `:tip-3 ⚠ tip 3 下方的注意事项。
`=
``
>>

>>链接到锚点

复用标准链接语法，使用以 # 开头的 URL：

`Faaa`B333
`!Micron`!
>>>
`=
`[跳转到安装说明`#install-notes]
`=
``
>>

当用户点击/激活该链接时，浏览器会将当前页面滚动到锚点所在行。

>>跳转到下一节

如果 URL 只是 `*#`*，后面不带名称，那么链接会跳转到文档中该链接自身位置之后出现的下一个 \`> 标题。这对于长段落之后的“继续 ↓”按钮很方便，无需给每个章节命名：

`Faaa`B333
`!Micron`!
>>
`=
`_`[继续`#]`_
`=
``
>

`Faaa`B333
>>
`_`[继续`#]`_
``
>

>>外部链接中的锚点

如果你想链接到另一个页面上的锚点，可以将其作为请求变量包含进去：

`Faaa`B333
`!Micron`!
>>
`=
`[结论`a8d24177d946de4f1f0a0fe1af9a1338:/page/document.mu`anchor=conclusion`]
`=
``
>

>>命名空间与冲突的说明

标题的自动锚点和显式 \`: 锚点在每个页面中共享同一个命名空间。如果显式锚点与标题 slug 冲突，或者标题与标题之间，显式锚点与显式锚点之间相互冲突，将跳转到`!最先声明`!的那个。

`:s7
>表格

若想包含渲染后的表格，可将其包在 \`t 标签中。可选地，你还可以在开头的 `\t 标签中添加属性以指定对齐方式和最大渲染宽度，例如 \`tc30 `F333`*(居中，30宽度)`*`f。

以下是一个示例：

`Faaa`B333
`!Micron`!
>>
`=
`t
| 名称 | 价格 | 数量 |
| ---- | :---: | --: |
| `F3a3苹果`f | 免费! | `!5`! |
| 橙子 | 需礼貌询问 | 3 |
`t
`=
``
>

`Faaa`B333
>>
`t
| 名称 | 价格 | 数量 |
| ---- | :---: | --: |
| `F3a3苹果`Faaa | 免费!!! | `!5`! |
| 橙子 | 需礼貌询问 | 3 |
`t
``
>

`:s8
>折叠小节

小节标题可以设置为可折叠的，这样读者就可以折叠长页面的部分内容。在标题前加上 \`+ 前缀，使其变为可折叠且默认打开状态；或者加上 \`- 前缀，使其变成可折叠且初始收起。这在任何级别的标题上都有效。标题后所有内容都归于折叠内容，直到下一个同级或高级的标题，或者一个重置章节的 \`< 之前。

`Faaa`B333
`!Micron`!
>>
`=
`+>>常见问题
本节初始展开，点击标题折叠

`->>更新日志
本节初始收起，点击标题展开

`+>>>嵌套折叠
深层标题在父标题内独立折叠
`=
``
>

这是渲染的同一个标识：

`Faaa`B333
`+>>常见问题
本节初始展开，点击标题折叠

`->>更新日志
本节初始收起，点击标题展开

`+>>>嵌套折叠
深层标题在父标题内独立折叠
``

>>折叠标志

可折叠标题前显示的标志默认在展开时为 ▾ ，在折叠时为 ▸ 。你可以通过以 `*#!fold`* 开头的注释行，在页面中的任何位置更改它们，行后依次跟展开标志符和折叠标志符。如果只提供一个标志符，则该符号将用于两种状态。

`Faaa`B333
`!Micron`!
>>>
`=
#!fold 点击收起 点击展开
`->>自定义标志
折叠内容。
`=
``
>>

`Faaa`B333
#!fold 点击收起 点击展开
`->>自定义标志
折叠内容。
#!fold ▾ ▸
``

`:s9
>字段与请求 (Fields & Requests)

`*Nomad Network`*允许你使用简单的输入字段，将数据提交到节点侧应用程序。提交的数据以及其他会话变量将作为环境变量，提供给节点侧脚本/程序使用。

>>请求链接 (Request Links)

链接可以包含请求变量以及要提交到节点侧应用程序的字段列表。你可以包含页面上的所有字段、仅特定字段，以及任意数量的请求变量。要简单地将页面上的所有字段提交到指定的节点侧页面，请创建如下链接：

`Faaa`B333
`!Micorn`!
>>>
`=
`[提交字段`:/page/fields.mu`*]
`=
``
>>

注意路径末尾额外 `!\``! 后面的 `!*`!。这个 `!*`! 表示 `*所有字段`*。你也可以像这样指定要包含的字段列表：

`Faaa`B333
`!Micron`!
>>>
`=
`[提交字段`:/page/fields.mu`username|auth_token]
`=
``
>>

如果你想包含预设变量，可以这样做：

`Faaa`B333
`!Micron`!
>>>
`=
`[系统查询`:/page/fields.mu`username|auth_token|action=view|amount=64]
`=
``
>>

>>字段 (Fields)

下面是一个创建字段的示例。我们将创建一个名为 `!user_input`! 的字段，并用文本 `!默认值`! 填充它。注意，我们使用背景颜色标签使该字段对用户更可见：

`Faaa`B333
`!Micron`!
>>>
`=
一个简单输入字段：`B444`<user_input`默认值>`b
`=
``
>>

你必须设置一个字段`*名称`*，但完全可以省略字段的默认值：

`Faaa`B333
`!Micron`!
>>>
`=
一个空输入字段：`B444`<demo_empty`>`b
`=
``
>>

你可以像这样设置字段大小：

`Faaa`B333
`!Micron`!
>>>
`=
一个指定大小的输入字段：`B444`<16|with_size`>`b
`=
``
>>

可以屏蔽字段，例如用于密码或类似用途：

`Faaa`B333
`!Micron`!
>>>
`=
一个屏蔽输入字段：`B444`<!|masked_demo`被隐藏的文本>`b
`=
``
>>

当然，你也可以同时控制所有参数：

`Faaa`B333
`!Micron`!
>>>
`=
完全控制：`B444`<!32|all_options`被隐藏的文本>`b
`=
``
>>

将上述标记汇总后会产生以下输出：

`Faaa`B333

一个简单输入字段：`B444`<user_input`默认值>`B333

一个空输入字段：`B444`<demo_empty`>`B333

一个指定大小的输入字段：  `B444`<16|with_size`>`B333

一个屏蔽输入字段：`B444`<!|masked_demo`被隐藏的文本>`B333

完全控制：`B444`<!32|all_options`被隐藏的文本>`B333
`f`b

>>>复选框 (Checkboxes)

除了文本字段之外，复选框是另一种提交数据的方式。它们允许用户进行单选或选择多个选项。

`Faaa`B333
`!Micron`!
>>>>
`=
`<?|field_name|value`>`b 标签文本`
`=
``
>>>

当复选框被选中时，它的字段将被设置为所提供的值。如果多个复选框共享同一字段名，则在发送到节点时，选中的值会用逗号连接。


`B444`<?|sign_up|1`>`b 注我册`

你也可以在字段值后追加 |* 来预先勾选复选框和单选框组。

`B444`<?|checkbox|1|*`>`b 预勾选复选框`

>>>单选框组 (Radio groups)

单选框组是另一种输入方式，允许用户从一组选项中选择。与复选框不同，具有相同字段名的单选按钮是互斥的。

示例：

`Faaa`B333
`!Micorn`!
>>>>
`=
`B900`<^|color|Red`>`b 红色

`B090`<^|color|Green`>`b 绿色

`B009`<^|color|Blue`>`b 蓝色
`=
``
>>>

将渲染为：

`B900`<^|color|Red`>`b 红色

`B090`<^|color|Green`>`b 绿色

`B009`<^|color|Blue`>`b 蓝色

在此示例中，当数据提交时，`B444`*field_color`*`b 将被设置为列表中选中的那个值。

``

`:sa
>注释

你可以通过行首以#字符开头来插入注释，这些注释不会显示在输出结果中。

以下是一个示例：
`Faaa`B333
`!Micron`!
>>
`=
# 此行不会显示
此行反之
`=
``
>

上述标记会产生以下输出：

`Faaa`B333
>>
# 此行不会显示
此行反之
``
>

`:sb
>局部片段 (Partials)

你可以在页面中包含局部片段，这些片段会在页面本身加载完成后异步加载。

`Faaa`B333
`!Micorn`!
>>
`=
`{f64a846313b874ee4a357040807f8c77:/page/partial_1.mu}
`=
``
>

也可以为局部片段设置自动刷新间隔。省略或设为 0 可禁用。以下局部片段将每 10 秒更新一次。

`Faaa`B333
`!Micorn`!
>>
`=
`{f64a846313b874ee4a357040807f8c77:/page/refreshing_partial.mu`10}
`=
``
>

你可以在局部片段更新中包含字段值和变量，并且通过设置 `!pid`! 变量，你可以创建更新一个或多个特定局部片段的链接。

`Faaa`B333
`!Micron`!
>>
`=
你的名字: `B444`<user_name`>`b

`F38a`[说:你好`p:32]`f

`{f64a846313b874e84a357039807f8c77:/page/hello_partial.mu`0`pid=32|user_name}
`=
``
>

`:sc
>字面量

要显示文字内容，例如源代码或不应被micron解释的文本，可以使用由\`=标签指定的字面块。你可以查看该文档的教学示例部分的源代码，其以字面块的形式呈现。

`:sd
>翻译事项、致谢与许可证

译者：Inter-Asiree

该翻译已上传至仓库：https://github.com/InterAsiree/Chinese-Micron-Turtorial-Micron-

>>翻译事项

本次翻译：
0. `Ff00夹带了一些译者个人的私货（个人风格）`f
1. 翻译并精校了全文
2. 修复了原文的一些风格问题
3. 夹带了一些译者个人的私货
4. 参照`*Markdown`*的代码块修改了部分样式
5. 修正了一些原文的知识性错误（或者模棱两可的描述）
6. `Ff80夹带了一些译者个人的私货`f
7. `Ffd0夹带了一些译者个人的私货`f
8. 为一些可能出现问题的地方添加了注释（尤其是中文使用者容易踩坑的地方）
9. `F9f0夹带了一些译者个人的私货`f
a. `F0f2夹带了一些译者个人的私货`f
b. `F0fd夹带了一些译者个人的私货`f
c. `F07f夹带了一些译者个人的私货`f
d. `F43f删除了一些译者个人的私货（噢，不）`f
e. `F70f该行用于凑够彩虹糖颜色`f
f. `Fe0f你发现了没？这个类别是十六进制的耶！`f

>>致谢

感谢`_`[RFnexus`https://github.com/RFnexus]`_的`_`[micron-parser-js工程`https://github.com/RFnexus/micron-parser-js]`_，该文章就是扒于该工程的。

Thanks to `_`[RFnexus`https://github.com/RFnexus]`_ for the `_`[micron-parser-js project`https://github.com/RFnexus/micron-parser-js]`_, this article is based on this project.

该项目可用方便快捷地帮助你编写Micron语法，静态网页由此进:`[https://rfnexus.github.io/micron-parser-js/]

顺便一提，我在翻译工作完成之后才发现同样的文章也在Nomad Network中内置一篇，因此译文可能与Nomadnet原文有些许不同，不过还是感谢Nomad Network的全体贡献者们。

>>许可证

原文为 `*Unlicense`* 许可

译文不沿用该许可证，我要使用 `[`*`!WTFPL`!`* 许可证`https://github.com/InterAsiree/Chinese-Micron-Turtorial-Micron-/LICENSE]!

-